{
	"movieInfo":
	[
		{
			"filmTitle": "Rogue One: A Star Wars Story",
			"releaseDate": "December 16th, 2016",
			"trailer": "sC9abcLLQpI",
			"imdb": "tt3748528",
			"synopsis": "From Lucasfilm comes the first of the Star Wars standalone films, \"Rogue One: A Star Wars Story\", an all-new epic adventure. In a time of conflict, a group of unlikely heroes band together on a mission to steal the plans to the Death Star, the Empire’s ultimate weapon of destruction. This key event in the Star Wars timeline brings together ordinary people who choose to do extraordinary things, and in doing so, become part of something greater than themselves."
		},
		{
			"filmTitle": "Resident Evil: The Final Chapter",
			"releaseDate": "January 27th, 2017",
			"trailer": "79Sd4GtOXuI",
			"imdb": "tt2592614",
			"synopsis": "Alice Abernathy (Milla Jovovich) continues her battle against The Umbrella Corporation's hostile AI system The Red Queen (Megan Charpentier) with the help of her friends Jill Valentine (Sienna Guillory), Leon Scott Kennedy (Johann Urb), Ada Wong (Li Bingbing), and her daughter Becky (Aryanna Engineer), while continuing an uneasy alliance with the former head of Umbrella, Albert Wesker (Shawn Roberts). Along the way, they will reconnect with former comrades Chris Redfield (Wentworth Miller), Claire Redfield (Ali Larter), and Kmart (Spencer Locke). Their epic battle will lead them back to where it all began in the dark mansion built by Umbrella founder Lord Ozwell E. Spencer and the deep underground research and development center known as The Hive, where The Red Queen plots total destruction over the human race."
		},
		{
			"filmTitle": "Guardians",
			"releaseDate": "February 23rd, 2017",
			"trailer": "T2rRo7PKRJE",
			"imdb": "tt4600952",
			"synopsis": "During the Cold War, an organization called \"Patriot\" created a super-hero squad, which includes members of multiple soviet republics. For years, the heroes had to hide their identities, but in hard times they must show themselves again."
		},
		{
			"filmTitle": "Power Rangers",
			"releaseDate": "March 24th, 2017",
			"trailer": "Q-C4qqsgs8w",
			"imdb": "tt3717490",
			"synopsis": "A group of high-school kids, who are infused with unique superpowers, harness their abilities in order to save the world."
		},
		{
			"filmTitle": "Guardians of the Galaxy Vol. 2",
			"releaseDate": "May 5th, 2017",
			"trailer": "2WhQcK-Zaok",
			"imdb": "tt3896198",
			"synopsis": "In Guardians of the Galaxy 2, Peter Quill a.k.a. Star-Lord and his team of misfits continue their adventures as guardians of the galaxy against all-new threatens as their team grows and Peter learns about who his father really is.<p>The first draft of the script is done, according Director James Gunn, who has said that Guardians of the Galaxy Vol. 2 will actually have less characters than he did in the first movie. A smaller cast and a more centralized story will be the focus of the Marvel sequel."
		},
		{
			"filmTitle": "Alien: Covenant",
			"releaseDate": "May 19th, 2017",
			"trailer": "IMDauaO3-s4",
			"imdb": "tt2316204",
			"synopsis": "Ridley Scott returns to the universe he created in Alien with Alien: Covenant, the second chapter in a prequel trilogy that began with Prometheus -- and connects directly to Scott’s 1979 seminal work of science fiction. Bound for a remote planet on the far side of the galaxy, the crew of the colony ship Covenant discovers what they think is an uncharted paradise, but is actually a dark, dangerous world -- whose sole inhabitant is the \"synthetic\" David (Michael Fassbender), survivor of the doomed Prometheus expedition."
		},
		{
			"filmTitle": "Wonder Woman",
			"releaseDate": "June 2nd, 2017",
			"trailer": "1Q8fG0TtVAY",
			"imdb": "tt0451279",
			"synopsis": "The story will explore the character’s origin, tracking the immortal Princess Diana’s rise as a warrior on the mythic island of Themyscira – and her eventual quest beyond its boundaries to the realm of ordinary men, where she will fight for this outside world amid the backdrop of World War I. Hints of the movie are foreshadowed in Batman v Superman, and the Wonder Woman film will include a modern framing story set after the events of that clash of heroes, according to producer Charles Roven."
		},
		{
			"filmTitle": "Transformers: The Last Knight",
			"releaseDate": "June 23rd, 2017",
			"trailer": "IqZIMGzQ1Pc",
			"imdb": "tt3371366",
			"synopsis": "The Last Knight has Optimus Prime searching through the cosmos for the Quintessons, the beings believed to be responsible for the creation of the Transformers race. Meanwhile back at home, Wahlberg's Cade Yeager will be facing a new alien threat that brings Lennox (and possibly Epps) back into duty. Isabela Moner has signed on as the female lead, though no character details have been revealed. The movie also has Jerrod Carmichael from NBC's The Carmichael Show as the comedic relief this time out. Shooting will take place in Detroit, with various on-location shoots planned to take place throughout the world."
		},
		{
			"filmTitle": "Spider-Man: Homecoming",
			"releaseDate": "July 7th, 2017",
			"trailer": "p9rpbL0lOXQ",
			"imdb": "tt2250912",
			"synopsis": "Marvel's Spiderman movie is set to reboot the franchise and bring the iconic Marvel character into The Avengers team. We will see the first appearance of Spider-man in Captain America: Civil War and he'll be wearing two suits.<p>Why two suits? Rumor has it, in the beginning of the movie Peter Parker is supposed to be dawning a homemade suit, and by the end of the film Tony Stark will be handing him the iconic red and blue suit we all know and love."
		},
		{
			"filmTitle": "The Dark Tower",
			"releaseDate": "July 28th, 2017",
			"trailer": "L7oKZAxLzqk",
			"imdb": "tt1648190",
			"synopsis": "Stephen King, Imagine Entertainment and Weed Road are in talks to create a movie trilogy and TV series based on King's \"The Dark Tower\" series.<p>At the age of 19, Stephen King decided he would like to write an epic similar to \"The Lord of the Rings\". The series written and published separately over a period of 22 years consists of seven books and the short story, \"The Little Sisters of Eluria\" published in his short story collection, \"Everything's Eventual\".<p>The first book, \"The Gunslinger\", introduces Roland Deschain of Gilead as he pursues the man in black to the mountains that separate the desert from the Western Sea. Along the way he rescues the boy, Jake, who is from a different time and place, and soon they become ka-tet in spite of Roland's single-minded goal of reaching the man in black at all costs."
		},
		{
			"filmTitle": "Thor: Ragnarok",
			"releaseDate": "November 3rd, 2017",
			"trailer": "7yjKbEiY1nM",
			"imdb": "tt3501632",
			"synopsis": "Also known as Thor 3, Thor (Chris Hemsworth) will return to Asgard when his home realm is threatened by the Ragnarok, which is the Norse apocalypse. Marvel's Kevin Feige has promised that Thor: Ragnarok is \"a very important movie for us in Marvel Phase 3...we plan on taking Thor to another level\"."
		}
	]
}
